In [1]:
import pandas as pd

In [2]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})

df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 3'])
df.head()

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 3  Vinod      Bird Seed   5.0

In [3]:
df.loc['Store 3']

Name                  Vinod
Item Purchased    Bird Seed
Cost                      5
Name: Store 3, dtype: object

In [4]:
type(df.loc['Store 3'])

pandas.core.series.Series

In [5]:
df.loc['Store 1']

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5

In [6]:
type(df.loc['Store 1'])

pandas.core.frame.DataFrame

In [7]:
df.loc['Store 1', 'Cost']

Store 1    22.5
Store 1     2.5
Name: Cost, dtype: float64

In [9]:
df.T

                 Store 1       Store 1    Store 3
Name               Chris         Kevyn      Vinod
Item Purchased  Dog Food  Kitty Litter  Bird Seed
Cost                22.5           2.5          5

In [10]:
df.T.loc['Cost']

Store 1    22.5
Store 1     2.5
Store 3       5
Name: Cost, dtype: object

In [11]:
df['Cost']

Store 1    22.5
Store 1     2.5
Store 3     5.0
Name: Cost, dtype: float64

In [13]:
df.loc['Store 1']['Cost']

Store 1    22.5
Store 1     2.5
Name: Cost, dtype: float64

In [14]:
df.loc[:, ['Name', 'Cost']]

          Name  Cost
Store 1  Chris  22.5
Store 1  Kevyn   2.5
Store 3  Vinod   5.0

In [15]:
df.drop('Store 1')

          Name Item Purchased  Cost
Store 3  Vinod      Bird Seed   5.0

In [17]:
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 3  Vinod      Bird Seed   5.0

In [21]:
copy_df = df.copy()
copy_df = copy_df.drop('Store 1')
copy_df

          Name Item Purchased  Cost
Store 3  Vinod      Bird Seed   5.0

In [22]:
del copy_df['Name']
copy_df

        Item Purchased  Cost
Store 3      Bird Seed   5.0

In [23]:
df['Location'] = None
df

          Name Item Purchased  Cost Location
Store 1  Chris       Dog Food  22.5     None
Store 1  Kevyn   Kitty Litter   2.5     None
Store 3  Vinod      Bird Seed   5.0     None